/**
*? Напишіть код, який запитуватиме
*? логін за допомогою prompt та логувати результат
*? у консоль браузера
    
*? Якщо відвідувач вводить "Адмін",
*? то prompt запитує пароль.
*? Якщо нічого не ввели або натиснуто клавішу Esc
*? вивести рядок "Скасовано"
*? В іншому випадку вивести рядок "Я вас не знаю"
    
*? Пароль перевіряти так:
*? Якщо введено пароль "Я головний",
*? то вивести рядок "Здрастуйте!"
*? інакше виводити рядок "Невірний пароль!"
  */

const login = prompt("Введіть логін");
const LOGIN = "Адмін";
const PASSWORD = "Я головний";
if (login === LOGIN) {
    const inPassword = prompt("Введіть пароль");
    if (!inPassword) {
        alert("Скасовано");
    } else {
        if (inPassword === PASSWORD) {
            alert("Здрастуйте!");
        } else {
            alert("Невірний пароль!");
        }
    }
} else {
    alert("Я вас не знаю");
}
